#+title: Scimax notebook
#+author: John Kitchin
#+date: [2019-02-20 Wed]
#+PROPERTY: header-args :tangle no

Scimax is designed to help scientists and engineers do their work more effectively. A crucial task for us is documenting our work. A scimax notebook is a concept built on the idea that your work is probably connected to a project, and the work on that project is probably in some root directory on your computer. This library provides functions to facilitate that idea.

We build on the [[https://github.com/bbatsov/projectile][projectile]] library which provides a persistent list of your projects, makes it easy to switch between them, etc. Here are the most common ones I use.

| keystrokes | action                     |
|------------+----------------------------|
| C-c pp     | Switch to a known project  |
| C-c pf     | Find file in project       |
| C-c pF     | Find file in /any/ project |
| C-c pb     | Switch to project buffer   |
| C-c pg     | Run grep in the project    |

There are /a lot/ of other commands you might want to review at https://www.projectile.mx/en/latest/usage/.

This module provides functions and capabilities for working in a scimax notebook.

Our concept of a notebook is that it is a directory that is a project as defined by projectile, which means it either has a file called .projectile in it or it is a git repo. We define a root directory for projects in =nb-notebook-directory=. Every notebook has a master file, README.org by default that is opened when you switch to the project.

- nb-new :: Interactively create a new notebook
- nb-open :: Interactively open an existing notebook to the master file
- nb-agenda :: Show the agenda for org-files in the notebook
- nb-archive :: Create an archive (customizable to be zip or tar) file of the project


#+BEGIN_SRC emacs-lisp :tangle no
(org-babel-load-file "scimax-notebook.org")
#+END_SRC

#+RESULTS:
: Loaded /Users/jkitchin/vc/jkitchin-github/scimax/scimax-notebook.el

** TODO List the tags in a notebook

The notebook is just a collection of org-files, so it should be possible to use the agenda commands to search for things in it using tags and properties. That means it would be helpful to get a list of tags in the notebook, e.g. to help construct the queries, or to make sure you use them consistently. Here we loop through all the org-files and collect the tags in a list. This is lightly tested, and in a large project might be slow.

#+BEGIN_SRC emacs-lisp  :tangle yes :results silent
(defun nb-list-tags ()
  "Get a list of tags in the notebook."
  (interactive)
  (let ((tags '())
	(already-open nil)
	(org-files (mapcar
		    (lambda (f) (expand-file-name
				 f (projectile-project-root)))
		    (-filter (lambda (f)
			       (and
				(f-ext? f "org")
				(not (s-contains? "#" f))))
			     (projectile-current-project-files))))
	(inhibit-local-variables-regexps))
    ;; Ignore local variables for this.
    (push "\\.org\\'" inhibit-local-variables-regexps)
    (cl-loop for org-file in org-files do
	     (setq already-open (find-buffer-visiting org-file))
	     (with-current-buffer (find-file-noselect org-file)
	       (save-excursion
		 (save-restriction
		   (widen)
		   (goto-char (point-min))
		   (while (re-search-forward org-heading-regexp nil t)
		     (setq tags (append tags (org-get-tags)))))))
	     (unless already-open
	       (kill-buffer already-open)
	       (setq already-open nil)))
    (-uniq tags)))


#+END_SRC

Here are the tags in this project.

#+filetags: random

#+BEGIN_SRC emacs-lisp
(nb-list-tags)
#+END_SRC

#+RESULTS:
| random | noexport | feature | slide | example | bug |



* Notebook/project links

I often want to make links between projects. For example, I may have notes in a proposal I want to reference, or I may want a link to work one of my students has done. Regular links don't work well for this. You cannot use absolute paths, because your project directory may be in another path than a collaborators. Absolute paths also break if you move the directory. Even relative paths don't work reliably because you may store the two projects in different relative locations. id links have potential to work, but I find them slow especially when you have never opened the org-file with that id in it; then org-mode may not be able to find it.

We need a different kind of link that allows you to specify a project, and a file in that project. Then, when you follow the link, it will look up the project in your list of known projects to get the root directory for it, and then construct a path to the file from that.

Here we define a new org-link for making links to files in notebooks. These links will look like nb:project-name::relative-file-path::link-target. If the target is not existent, the link will be red.

- project-name :: Name of project, usually at the end of the absolute path to the project directory.
- relative-file-path :: Path to a file, usually relative to the project root
- link-target :: a number, or char position, or regexp to find in the file. For org-files, this can be any kind of org-link modifier.


#+BEGIN_SRC emacs-lisp  :tangle yes :results silent
(defun nb-parse-path (path)
  "Parse PATH into parts.
PATH is a :: separated string with up to 3 parts.
Returns a list of (project fpath link-target).
The link target is optional, and defaults to line 1."
  ;; Somehow split-string must change match-data. This messes up
  ;; fontification...
  (save-match-data
    (let* ((parts (split-string path "::")))
      (when (> (length parts) 3)
	(error "There should only be 3 parts separated by ::"))
      (list
       (nth 0 parts)
       (nth 1 parts)
       (or (nth 2 parts) "1")))))


#+END_SRC


Here are a few example paths and how they are parsed.

#+BEGIN_SRC emacs-lisp
(list (nb-parse-path "project::fpath")
      (nb-parse-path "project::fpath::c6"))
#+END_SRC

#+RESULTS:
| project | fpath |  1 |
| project | fpath | c6 |


